#+title: Lisp 3rd Edition
#+author: Patrick Henry Winston & Berthold Klaus Paul Horn
#+date: 1989

*** The Backquote Mechanism Simplifies Templated Filling

Lisp's  *backquote mechanism*  makes  it  easy to  create  and to  complete
templatelike expressions in which only a  few, variable, details need to be
filled in.   Whenever a comma  appears inside a backquoted  expression, the
subexpression immediately following the comma is replaced by its value:

#+name: backquote-example1
#+caption: Backquote Example 1
#+begin_src lisp :results value verbatim :exports both
  (defparameter variable 'test)
  `(THIS IS A ,VARIABLE)
#+end_src

#+RESULTS: backquote-example1
: (THIS IS A TEST)

Backquote also allows a comma conjoined to an at sign =@=.  The combination
unquotes the following expression, just as  a comma does, but the resulting
value must be  a list..  The elements  in this list are  /spliced/ into the
list in which the =,@= appears, rather than /inserted/ as an element.

#+name: backquote-with=@-example
#+caption: Backquote with @ Example
#+begin_src lisp :results output :exports both
  (defparameter variable '(more difficult example))
  (print `(this is a ,variable))
  (print `(this is a ,@variable))
#+end_src

#+RESULTS: backquote-with=@-example
: 
: (THIS IS A (MORE DIFFICULT EXAMPLE)) 
: (THIS IS A MORE DIFFICULT EXAMPLE) 

